apache/nuttx/arch/arm/src/common/stm32/stm32_serial_m3m4_v1v2v3v4.c
#  endif

/* The DMA buffer size when using RX DMA to emulate a FIFO.
 *
 * When streaming data, the generic serial layer will be called
 * every time the FIFO receives half this number of bytes.
 */
#  if !defined(CONFIG_STM32_SERIAL_RXDMA_BUFFER_SIZE)
#    define CONFIG_STM32_SERIAL_RXDMA_BUFFER_SIZE 32
#  endif
#  define RXDMA_MUTIPLE  4
#  define RXDMA_MUTIPLE_MASK  (RXDMA_MUTIPLE -1)
#  define RXDMA_BUFFER_SIZE   ((CONFIG_STM32_SERIAL_RXDMA_BUFFER_SIZE \
                                + RXDMA_MUTIPLE_MASK) \
                                & ~RXDMA_MUTIPLE_MASK)

/* DMA priority */

#  ifndef CONFIG_USART_RXDMAPRIO
#    if defined(CONFIG_STM32_HAVE_IP_DMA_V1)
#      define CONFIG_USART_RXDMAPRIO  DMA_CCR_PRIMED
#    elif defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#      define CONFIG_USART_RXDMAPRIO  DMA_SCR_PRIMED
#    else
#      error "Unknown STM32 DMA"
#    endif
#  endif
#  if defined(CONFIG_STM32_HAVE_IP_DMA_V1)
#    if (CONFIG_USART_RXDMAPRIO & ~DMA_CCR_PL_MASK) != 0
#      error "Illegal value for CONFIG_USART_RXDMAPRIO"
#    endif
#  elif defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#    if (CONFIG_USART_RXDMAPRIO & ~DMA_SCR_PL_MASK) != 0
#      error "Illegal value for CONFIG_USART_RXDMAPRIO"
#    endif
#  else
#    error "Unknown STM32 DMA"
#  endif

/* DMA control word */

#  if defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#    define SERIAL_RXDMA_CONTROL_WORD     \
                (DMA_SCR_DIR_P2M        | \
                 DMA_SCR_CIRC           | \
                 DMA_SCR_MINC           | \
                 DMA_SCR_PSIZE_8BITS    | \
                 DMA_SCR_MSIZE_8BITS    | \
                 CONFIG_USART_RXDMAPRIO | \
                 DMA_SCR_PBURST_SINGLE  | \
                 DMA_SCR_MBURST_SINGLE)
#  else
#    define SERIAL_RXDMA_CONTROL_WORD    \
                (DMA_CCR_CIRC          | \
                 DMA_CCR_MINC          | \
                 DMA_CCR_PSIZE_8BITS   | \
                 DMA_CCR_MSIZE_8BITS   | \
                 CONFIG_USART_RXDMAPRIO)
#  endif

#endif /* SERIAL_HAVE_RXDMA */

#ifdef SERIAL_HAVE_TXDMA

#  if defined(CONFIG_STM32_HAVE_IP_DMA_V2)

/* Verify that DMA has been enabled and the DMA channel has been defined.
 */

#    if defined(CONFIG_USART1_TXDMA) || defined(CONFIG_USART6_TXDMA)
#      ifndef CONFIG_STM32_DMA2
#        error STM32 USART1/6 receive DMA requires CONFIG_STM32_DMA2
#      endif
#    endif

#    if defined(CONFIG_USART2_TXDMA) || defined(CONFIG_USART3_TXDMA) || \
      defined(CONFIG_UART4_TXDMA) || defined(CONFIG_UART5_TXDMA) || \
      defined(CONFIG_UART7_TXDMA) || defined(CONFIG_UART8_TXDMA)
#      ifndef CONFIG_STM32_DMA1
#        error STM32 USART2/3/4/5/7/8 receive DMA requires CONFIG_STM32_DMA1
#      endif
#    endif

/* Currently RS-485 support cannot be enabled when TXDMA is in use due to
 * lack of testing - RS-485 support was developed on STM32F1x
 */

#    if (defined(CONFIG_USART1_TXDMA) && defined(CONFIG_USART1_RS485)) || \
        (defined(CONFIG_USART2_TXDMA) && defined(CONFIG_USART2_RS485)) || \
        (defined(CONFIG_USART3_TXDMA) && defined(CONFIG_USART3_RS485)) || \
        (defined(CONFIG_UART4_TXDMA) && defined(CONFIG_UART4_RS485)) || \
        (defined(CONFIG_UART5_TXDMA) && defined(CONFIG_UART5_RS485)) || \
        (defined(CONFIG_USART6_TXDMA) && defined(CONFIG_USART6_RS485)) || \
        (defined(CONFIG_UART7_TXDMA) && defined(CONFIG_UART7_RS485)) || \
        (defined(CONFIG_UART8_TXDMA) && defined(CONFIG_UART8_RS485))
#      error "TXDMA and RS-485 cannot be enabled at the same time for the same U[S]ART"
#    endif

#    if defined(CONFIG_USART1_TXDMA) && !defined(DMAMAP_USART1_TX)
#      error "USART1 DMA channel not defined (DMAMAP_USART1_TX)"
#    endif

#    if defined(CONFIG_USART2_TXDMA) && !defined(DMAMAP_USART2_TX)
#      error "USART2 DMA channel not defined (DMAMAP_USART2_TX)"
#    endif

#    if defined(CONFIG_USART3_TXDMA) && !defined(DMAMAP_USART3_TX)
#      error "USART3 DMA channel not defined (DMAMAP_USART3_TX)"
#    endif

#    if defined(CONFIG_UART4_TXDMA) && !defined(DMAMAP_UART4_TX)
#      error "UART4 DMA channel not defined (DMAMAP_UART4_TX)"
#    endif

#    if defined(CONFIG_UART5_TXDMA) && !defined(DMAMAP_UART5_TX)
#      error "UART5 DMA channel not defined (DMAMAP_UART5_TX)"
#    endif

#    if defined(CONFIG_USART6_TXDMA) && !defined(DMAMAP_USART6_TX)
#      error "USART6 DMA channel not defined (DMAMAP_USART6_TX)"
#    endif

#    if defined(CONFIG_UART7_TXDMA) && !defined(DMAMAP_UART7_TX)
#      error "UART7 DMA channel not defined (DMAMAP_UART7_TX)"
#    endif

#    if defined(CONFIG_UART8_TXDMA) && !defined(DMAMAP_UART8_TX)
#      error "UART8 DMA channel not defined (DMAMAP_UART8_TX)"
#    endif

#  elif defined(CONFIG_STM32_HAVE_IP_DMA_V1)

#    if defined(CONFIG_USART1_TXDMA) || defined(CONFIG_USART2_TXDMA) || \
      defined(CONFIG_USART3_TXDMA) || defined(CONFIG_LPUART1_TXDMA)
#      ifndef CONFIG_STM32_DMA1
#        error STM32 USART1/2/3 receive DMA requires CONFIG_STM32_DMA1
#      endif
#    endif

#    if defined(CONFIG_UART4_TXDMA) || defined(CONFIG_UART5_TXDMA)
#      ifndef CONFIG_STM32_DMA2
#        error STM32 UART4/5 receive DMA requires CONFIG_STM32_DMA2
#      endif
#    endif

#    define DMAMAP_USART1_TX  DMACHAN_USART1_TX
#    define DMAMAP_USART2_TX  DMACHAN_USART2_TX
#    define DMAMAP_USART3_TX  DMACHAN_USART3_TX
#    define DMAMAP_UART4_TX   DMACHAN_UART4_TX
#    define DMAMAP_UART5_TX   DMACHAN_UART5_TX
#    if defined(CONFIG_LPUART1_TXDMA) && defined(CONFIG_STM32_STM32G4XXX)
#      define DMAMAP_LPUART1_TX DMAMAP_DMA12_LPUART1TX_0
#    endif

#  endif

/* DMA priority */

#  ifndef CONFIG_USART_TXDMAPRIO
#    if defined(CONFIG_STM32_HAVE_IP_DMA_V1)
#      define CONFIG_USART_TXDMAPRIO  DMA_CCR_PRIMED
#    elif defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#      define CONFIG_USART_TXDMAPRIO  DMA_SCR_PRIMED
#    else
#      error "Unknown STM32 DMA"
#    endif
#  endif
#  if defined(CONFIG_STM32_HAVE_IP_DMA_V1)
#    if (CONFIG_USART_TXDMAPRIO & ~DMA_CCR_PL_MASK) != 0
#      error "Illegal value for CONFIG_USART_TXDMAPRIO"
#    endif
#  elif defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#    if (CONFIG_USART_TXDMAPRIO & ~DMA_SCR_PL_MASK) != 0
#      error "Illegal value for CONFIG_USART_TXDMAPRIO"
#    endif
#  else
#    error "Unknown STM32 DMA"
#  endif

/* DMA control word */

#  if defined(CONFIG_STM32_HAVE_IP_DMA_V2)
#    define SERIAL_TXDMA_CONTROL_WORD                         \
                (DMA_SCR_DIR_M2P        |                     \
                 DMA_SCR_MINC           |                     \
                 DMA_SCR_PSIZE_8BITS    |                     \
                 DMA_SCR_MSIZE_8BITS    |                     \
                 CONFIG_USART_TXDMAPRIO |                     \
                 DMA_SCR_PBURST_SINGLE  |                     \
                 DMA_SCR_MBURST_SINGLE)
#  elif defined(CONFIG_STM32_HAVE_IP_DMA_V1)
#    define SERIAL_TXDMA_CONTROL_WORD                         \
                (DMA_CCR_DIR           |                      \
                 DMA_CCR_MINC          |                      \
                 DMA_CCR_PSIZE_8BITS   |                      \
                 DMA_CCR_MSIZE_8BITS   |                      \
                 CONFIG_USART_TXDMAPRIO)
#  else
#    error "Unknown STM32 DMA"
#  endif

