apache/nuttx/arch/arm/src/common/stm32/stm32_serial_m3m4_v1v2v3v4.c
static inline void up_setusartint(struct up_dev_s *priv, uint16_t ie)
{
  uint32_t cr;

  /* Save the interrupt mask */

  priv->ie = ie;

  /* And restore the interrupt state (see the interrupt enable/usage
   * table above)
   */

  cr  = up_serialin(priv, STM32_USART_CR1_OFFSET);
  cr &= ~(USART_CR1_USED_INTS);
  cr |= (ie & (USART_CR1_USED_INTS));
  up_serialout(priv, STM32_USART_CR1_OFFSET, cr);

  cr  = up_serialin(priv, STM32_USART_CR3_OFFSET);
  cr &= ~USART_CR3_EIE;
  cr |= (ie & USART_CR3_EIE);
  up_serialout(priv, STM32_USART_CR3_OFFSET, cr);
}

/****************************************************************************
 * Name: up_restoreusartint
 ****************************************************************************/

static void up_restoreusartint(struct up_dev_s *priv, uint16_t ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  up_setusartint(priv, ie);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_disableusartint
 ****************************************************************************/

static void up_disableusartint(struct up_dev_s *priv, uint16_t *ie)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  if (ie)
    {
      uint32_t cr1;
      uint32_t cr3;

      /* USART interrupts:
       *
       * Enable             Status          Meaning                Usage
       * ------------------ --------------- ---------------------- ----------
       * USART_CR1_IDLEIE   USART_SR_IDLE   Idle Line Detected     (not used)
       * USART_CR1_RXNEIE   USART_SR_RXNE   Rx Data Ready
       * "              "   USART_SR_ORE    Overrun Error Detected
       * USART_CR1_TCIE     USART_SR_TC     Transmission Complete  (RS-485)
       * USART_CR1_TXEIE    USART_SR_TXE    Tx Data Register Empty
       * USART_CR1_PEIE     USART_SR_PE     Parity Error
       *
       * USART_CR2_LBDIE    USART_SR_LBD    Break Flag
       * USART_CR3_EIE      USART_SR_FE     Framing Error
       * "           "      USART_SR_NE     Noise Error
       * "           "      USART_SR_ORE    Overrun Error Detected
       * USART_CR3_CTSIE    USART_SR_CTS    CTS flag               (not used)
       */

      cr1 = up_serialin(priv, STM32_USART_CR1_OFFSET);
      cr3 = up_serialin(priv, STM32_USART_CR3_OFFSET);

      /* Return the current interrupt mask value for the used interrupts.
       * Notice that this depends on the fact that none of the used interrupt
       * enable bits overlap.  This logic would fail if we needed the break
       * interrupt!
       */

      *ie = (cr1 & (USART_CR1_USED_INTS)) | (cr3 & USART_CR3_EIE);
    }

  /* Disable all interrupts */

  up_setusartint(priv, 0);

  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_dma_nextrx
 *
 * Description:
 *   Returns the index into the RX FIFO where the DMA will place the next
 *   byte that it receives.
 *
 ****************************************************************************/

#ifdef SERIAL_HAVE_RXDMA
static int up_dma_nextrx(struct up_dev_s *priv)
{
  size_t dmaresidual;

  dmaresidual = stm32_dmaresidual(priv->rxdma);

  return (RXDMA_BUFFER_SIZE - (int)dmaresidual);
}
#endif

/****************************************************************************
 * Name: up_set_format
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void up_set_format(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX) || \
    defined(CONFIG_STM32_STM32F37XX) || defined(CONFIG_STM32_STM32G4XXX)
  uint32_t usartdiv8;
#else
  uint32_t usartdiv32;
  uint32_t mantissa;
  uint32_t fraction;
#endif
  uint32_t regval;
  uint32_t brr;

  /* Load CR1 */

  regval = up_serialin(priv, STM32_USART_CR1_OFFSET);

#if defined(CONFIG_STM32_STM32G4XXX)
  regval &= ~(USART_CR1_UE | USART_CR1_TE | USART_CR1_RE);
  up_serialout(priv, STM32_USART_CR1_OFFSET, regval);
#endif
#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX)|| \
    defined(CONFIG_STM32_STM32F37XX) || defined(CONFIG_STM32_STM32G4XXX)

#ifdef CONFIG_STM32_LPUART1
  if (priv->islpuart == true)
    {
      /* LPUART BRR (19:00) = (256*apbclock_hz/baud_rate) */

      uint32_t apbclock_whole = priv->apbclock;
      uint32_t clock_baud_ratio = apbclock_whole / priv->baud;
      uint32_t presc_reg = 0x0;

      /* LPUART PRESC (3:0)
       * Divide the apbclock if necessary for low baud rates
       * 3 * baud_rate <= apbclock_whole <= 4096 * baud_rate
       */

      if (clock_baud_ratio <= 4096)
        {
          presc_reg = 0x0;
        }
      else if (clock_baud_ratio > 4096 && clock_baud_ratio <= 8192)
        {
          presc_reg = 0x1;
          apbclock_whole >>= 1;
        }
      else if (clock_baud_ratio > 8192 && clock_baud_ratio <= 16384)
        {
          presc_reg = 0x2;
          apbclock_whole >>= 2;
        }
      else if (clock_baud_ratio > 16384 && clock_baud_ratio <= 24576)
        {
          presc_reg = 0x3;
          apbclock_whole /= 6;
        }
      else if (clock_baud_ratio > 24576 && clock_baud_ratio <= 32768)
        {
          presc_reg = 0x4;
          apbclock_whole >>= 3;
        }
      else if (clock_baud_ratio > 32768 && clock_baud_ratio <= 40960)
        {
          presc_reg = 0x5;
          apbclock_whole /= 10;
        }
      else if (clock_baud_ratio > 40960 && clock_baud_ratio <= 49152)
        {
          presc_reg = 0x6;
          apbclock_whole /= 12;
        }
      else if (clock_baud_ratio > 32768 && clock_baud_ratio <= 65536)
        {
          presc_reg = 0x7;
          apbclock_whole >>= 4;
        }
      else if (clock_baud_ratio > 65536  && clock_baud_ratio <= 131072)
        {
          presc_reg = 0x8;
          apbclock_whole >>= 5;
        }
      else if (clock_baud_ratio > 131072  && clock_baud_ratio <= 262144)
        {
          presc_reg = 0x9;
          apbclock_whole >>= 6;
        }
      else if (clock_baud_ratio > 262144  && clock_baud_ratio <= 524288)
        {
          presc_reg = 0xa;
          apbclock_whole >>= 7;
        }
      else
        {
          presc_reg = 0xb;
          apbclock_whole >>= 8;
        }

      /* Write the PRESC register */

