apache/nuttx/arch/arm/src/common/stm32/stm32_serial_m3m4_v1v2v3v4.c
#ifdef CONFIG_USART6_RXDMA
  if (g_usart6priv.rxdma != NULL)
    {
      up_dma_rxcallback(g_usart6priv.rxdma, 0, &g_usart6priv);
    }
#endif

#ifdef CONFIG_UART7_RXDMA
  if (g_uart7priv.rxdma != NULL)
    {
      up_dma_rxcallback(g_uart7priv.rxdma, 0, &g_uart7priv);
    }
#endif

#ifdef CONFIG_UART8_RXDMA
  if (g_uart8priv.rxdma != NULL)
    {
      up_dma_rxcallback(g_uart8priv.rxdma, 0, &g_uart8priv);
    }
#endif

#ifdef CONFIG_LPUART1_RXDMA
  if (g_lpuart1priv.rxdma != NULL)
    {
      up_dma_rxcallback(g_lpuart1priv.rxdma, 0, &g_lpuart1priv);
    }
#endif

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

#ifndef CONFIG_ARM_SEMIHOSTING_SYSLOG
void up_putc(int ch)
{
#if CONSOLE_UART > 0
  struct up_dev_s *priv = g_uart_devs[CONSOLE_UART - 1];
#elif CONSOLE_LPUART > 0
  struct up_dev_s *priv = g_lpuart_devs[CONSOLE_LPUART - 1];
#endif

#if CONSOLE_UART > 0 || CONSOLE_LPUART > 0
  uint16_t ie;

  up_disableusartint(priv, &ie);
  arm_lowputc(ch);
  up_restoreusartint(priv, ie);
#endif
}
#endif

#else /* USE_SERIALDRIVER */

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

#ifndef CONFIG_ARM_SEMIHOSTING_SYSLOG
void up_putc(int ch)
{
#if CONSOLE_UART > 0 || CONSOLE_LPUART > 0
  arm_lowputc(ch);
#endif
}
#endif

#endif /* USE_SERIALDRIVER */
